Repository: mozochek/sports_complex_app
Catalog: lib/l10n/intl_*.arb
Languages: ru

# app_name
source: Sports Complex
ru: Спортивный центр

# welcome_text
source: Welcome
ru: Добро пожаловать

# sports_complex_text
source: Sports complex
ru: Спортивный комплекс

# workouts_schedule_text
source: Workouts schedule
ru: Расписание тренировок

# health_text
source: Health
ru: Здоровье

# sign_in_screen_title
source: Welcome back
ru: С возвращением

# sign_in_screen_subtitle
source: We were waiting for you
ru: Мы вас ждали

# sign_up_screen_title
source: Sign Up
ru: Регистрация

# sign_up_screen_subtitle
source: Register to start using the application
ru: Зарегестрируйтесь, чтобы начать пользоваться приложением

# do_not_have_an_account_text
source: Do not have an account
ru: Нет аккаунта

# already_registered_text
source: Already registered
ru: Уже зарегестрированы

# home_text
source: Home
ru: Главная

# schedule_text
source: Schedule
ru: Расписание

# profile_text
source: Profile
ru: Профиль

# favorite_workouts_text
source: Favorite workouts
ru: Избранные тренировки

# admin_console_text
source: Admin console
ru: Консоль администратора

# add_schedule_text
source: Add schedule
ru: Добавить расписание

# write_news_text
source: Write news
ru: Написать новость

# settings_text
source: Settings
ru: Настройки

# cancel_text
source: Cancel
ru: Отмена

# delete_text
source: Delete
ru: Удалить

# sign_in_text
source: Sign In
ru: Войти

# sign_up_text
source: Sign Up
ru: Зарегестрироваться

# sign_out_text
source: Sign Out
ru: Выход

# email_text
source: Email
ru: Почта

# password_text
source: Password
ru: Пароль

# list_is_empty_text
source: List is empty
ru: Список пуст

# unknown_text
source: Unknown
ru: Неизвестно

# user_text
source: User
ru: Пользователь

# coach_text
source: Coach
ru: Тренер

# admin_text
source: Admin
ru: Администратор

# list_of_coaches_text
source: List of trainers
ru: Список тренеров

# list_of_halls_text
source: List of halls
ru: Список залов

# sign_out_confirmation_dialog_title
source: Sign Out?
ru: Выйти из аккаунта?

# sign_out_confirmation_dialog_content
source: You will be sign out of your current account and will be redirected to the login screen.
ru: Вы выйдите из текущего аккаунта и будете перенаправлены на экран авторизации.

# coach_delete_confirmation_dialog_title
source: Delete coach?
ru: Удалить тренера?

# coach_delete_confirmation_dialog_content
source: This will delete selected coach from list.
ru: Выбранный тренер будет удален из списка.

# hall_form_title
source: Add hall
ru: Добавить зал

# hall_form_hall_name_label_text
source: Hall name
ru: Название зала

# hall_delete_dialog_title
source: Delete hall?
ru: Удалить зал?

# hall_delete_dialog_content
source: This will delete selected hall from list.
ru: Выбранный зал будет удален из списка.

# loading_data_text
source: Loading data
ru: Загрузка данных

# no_schedule_for_this_date_text
source: There is no schedule for this date
ru: Расписание на эту дату отсутствует

source: Invalid email or password
ru: Неправильно введены email или пароль

# user_disabled
source: User is disabled
ru: Данный пользователь временно отключен

source: User not found
ru: Данный пользователь не найден

# too_many_requests
source: Too many requests. Try later
ru: Слишком много попыток. Попробуйте позже

source: User data is empty
ru: Не удалось получить данные пользователя

# network_problems
source: Network problems. Check your internet connection
ru: Проблемы с сетью. Проверьте подключение к интернету

source: Unsupported error
ru: Неподдерживаемая ошибка

source: Unknown error
ru: Неизвестная ошибка

source: Email already in use
ru: Данный адрес эл.почты уже зарегестрирован

# operation_not_allowed
source: This operation is not allowed. Try later
ru: Данный вид регистрации временно недоступен. Попробуйте позже

source: Weak password
ru: Введен слабый пароль

# incorrect_data
source: Incorrect data entered
ru: Введены некорректные данные

# invalid_user_surname
source: At least 2 characters
ru: Фамилия должна состоять из 2 и более символов

# invalid_user_name
source: At least 2 characters
ru: Имя должно состоять из 2 и более символов

source: Invalid email
ru: Введен некорректный адрес эл.почты
